{
    "authors":["The Associated Press"],
    "publish_date":1727809620000,
    "title":"John Amos, star of Good Times and Roots, dead at 84",
    "site_name":"CBC",
    "url":"https:\/\/www.cbc.ca\/news\/entertainment\/john-amos-good-times-roots-obituary-1.7339138",
    "text":"John Amos, who starred as the family patriarch on the hit 1970s sitcom Good Times and earned an Emmy nomination for his role in the seminal 1977 miniseries Roots, has died. He was 84.\n\nAmos' publicist, Belinda Foster, confirmed that he had died of natural causes on Aug. 21 in Los Angeles.\n\nHe played James Evans Sr. on Good Times, which featured one of television's first Black two-parent families. Produced by Norman Lear and co-created by actor Mike Evans, who co-starred on All in the Family and The Jeffersons, it ran from 1974-79 on CBS.\n\n\"Many fans consider him their TV father,\" his son, Kelly Christopher Amos, said in a statement. \"He lived a good life. His legacy will live on in his outstanding works in television and film as an actor. My father loved working as an actor throughout his entire life. He was my dad, my best friend, and my hero.\"\n\n\"That show was the closest depiction in reality to life as an African American family living in those circumstances as it could be,\" Amos told Time magazine in 2021.\n\nHis film credits included Let's Do It Again with Bill Cosby and Sidney Poitier, Coming to America with Eddie Murphy and its 2021 sequel Coming 2 America, along with Die Hard 2, Madea's Witness Protection and Uncut Gems with Adam Sandler. He also appeared in Ice Cube and Dr. Dre's 1994 music video for the song Natural Born Killaz.\n\nAmos' first major TV role was as Gordy Howard, the weatherman on The Mary Tyler Moore Show from 1970-73. As the show's only Black character, he played straight man to bombastic anchor Ted Baxter.\n\nAmos' Good Times character, along with wife Florida, played by Esther Rolle, originated on another Lear show, Maude. His character often worked two manual labour jobs to support his family that included three children, with Jimmie Walker becoming a breakout star as eldest son J.J.\n\nThe show was so impactful on the culture that artists ranging from Alicia Keys, Rick Ross and the Wu-Tang Clan have name-checked Amos or his character in their lyrics.\n\nFrustrations on Good Times\n\nThe elder Amos and Rolle were eager to portray a positive image of a Black family, struggling against the odds in a public housing project in Chicago. But they grew frustrated at seeing Walker's character being made foolish and his role expanded.\n\n\"The fact is that Esther's criticism, and also that of John and others — some of it very pointed and personal — seriously damaged my appeal in the Black community,\" Walker wrote in his 2012 memoir Dyn-O-Mite! Good Times, Bad Times, Our Times.\n\nAfter three seasons of critical acclaim and high ratings, Amos was fired. He had become critical of the show's white writing staff creating storylines that he felt were inauthentic to the Black characters.\n\n\"There were several examples where I said, 'No, you don't do these things. It's anathema to Black society. I'll be the expert on that, if you don't mind,' \" he told Time.\n\n\"And it got confrontational and heated enough that ultimately my being killed off the show was the best solution for everybody concerned, myself included.\"\n\nSaw Roots role as 'reward'\n\nAmos quickly bounced back, landing the role of an adult Kunta Kinte, the central character of Roots, based on Alex Haley's novel set during and after the era of slavery in the U.S.\n\nThe miniseries was a critical and ratings blockbuster, and Amos earned one of its 37 Emmy nominations.\n\n\"I knew that it was a life-changing role for me, as an actor and just from a humanistic standpoint,\" he told Time. \"It was the culmination of all of the misconceptions and stereotypical roles that I had lived and seen being offered to me. It was like a reward for having suffered those indignities.\"\n\nBorn John Allen Amos Jr. on Dec. 27, 1939, in Newark, N.J., he was the son of an auto mechanic. He graduated from Colorado State University with a sociology degree and played on the school's football team.\n\nHe had a brief professional football career, playing in various minor leagues. He signed a free-agent contract in 1967 with the Kansas City Chiefs, but coach Hank Stram encouraged Amos to pursue his interest in writing instead.\n\nHe had jobs as an advertising and comedy writer before moving in front of the camera.\n\nIn 2020, Amos, who served in the New Jersey National Guard, was inducted into the New Jersey Hall of Fame.\n\nHe is survived by daughter Shannon, a former entertainment executive, and Kelly Christopher, a Grammy-nominated video music director and editor. They were from his first marriage to Noel Mickelson, whom he met in college. His second marriage to actor Lillian Lehman also ended in divorce."
}
